# GetCustomHandleTag Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetCustomHandleTag Method
RebarConstraint Class See Also
---
Returns the handle tag of the RebarConstrainedHandle. This is valid only for Free Form Rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int GetCustomHandleTag()
```

Visual Basic
---
```text
Public Function GetCustomHandleTag As Integer
```

Visual C++
---
```text
public:
int GetCustomHandleTag()
```

# ### Return Value
Returns the handle tag of the RebarConstrainedHandle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Constrained rebar is a shape driven rebar element. |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace